Revit 2027 API
ViewActivatingEventArgs.NewActiveView Property
 The view that is going to become active.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View NewActiveView { get; }
Public ReadOnly Property NewActiveView As View
	Get
public:
property View^ NewActiveView {
	View^ get ();
}
member NewActiveView : View with get
Property Value
View
See Also
Reference
ViewActivatingEventArgs Class
Autodesk.Revit.UI.Events Namespace